# Pandas Practise    Date: 28 June 2020

In [2]:
import pandas as pd
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
 'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
 'hire_date': [2004, 2008, 2012, 2014]})

In [3]:
df1

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

In [4]:
df1.drop(employee)

NameError: name 'employee' is not defined

In [6]:
df1.drop('employee',axis=1)

         group
0   Accounting
1  Engineering
2  Engineering
3           HR

In [7]:
df1

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

In [8]:
df1.set_index('employee')

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR

In [9]:
pd.merge(df1,df2)

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [10]:
pd.merge(df1,df2).set_index('employee')

                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

In [12]:
df1=df1.set_index('employee')

In [13]:
df2=df2.set_index('employee')

In [14]:
df2

          hire_date
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014

In [15]:
df1.join(df2)

                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

In [16]:
pd.merge(df1,df2)

MergeError: No common columns to perform merge on. Merge options: left_on=None, right_on=None, left_index=False, right_index=False

In [17]:
pd.merge(df1,df2, right_index=True, left_index=True)

                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

In [18]:
 df6 = pd.DataFrame({'name': ['Peter', 'Paul', 'Mary'],
 'food': ['fish', 'beans', 'bread']},
 columns=['name', 'food'])
    
 df7 = pd.DataFrame({'name': ['Mary', 'Joseph'],
 'drink': ['wine', 'beer']},
 columns=['name', 'drink'])

In [19]:
df6

    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread

In [20]:
df7

     name drink
0    Mary  wine
1  Joseph  beer

In [26]:
pd.merge(df6,df7)

   name   food drink
0  Mary  bread  wine

In [27]:
pd.merge(df6,df7,how='inner')

   name   food drink
0  Mary  bread  wine

In [30]:
pd.merge(df6,df7,how='right')

     name   food drink
0    Mary  bread  wine
1  Joseph    NaN  beer

In [31]:
pd.merge(df6,df7,on='name')

   name   food drink
0  Mary  bread  wine